app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
  def index
    render json: Comment.where(post_id: params[:post_id]).to_a

INSERT INTO "comments" ("user_id", "post_id", "body", "created_at", "updated_at", "ign") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 3], ["post_id", 2], ["body", "cocmcmcmcmcomments"], ["created_at", "2020-05-12 19:38:32.808144"], ["updated_at", "2020-05-12 19:38:32.808144"], ["ign", "A dude"]]
---
  def create
    new_comment = Comment.new(comment_params)
    new_comment.user = current_user
    new_comment.post_id = params[:post_id]

    if new_comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def edit
    render json: Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def update
    updated_comment = Comment.find(params[:id])

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 10]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def destroy
    deleted_comment = Comment.find(params[:id]).delete