app/controllers/api/v1/posts_controller.rb

  def index
    render json: {
      target: serialized_data(Post.all, PostSerializer),
      current: serialized_data(current_user, PostSerializer)
---
SELECT "posts".* FROM "posts"

  def create
    new_post = Post.new(post_params)
    new_post.user = current_user

    if new_post.save
---
INSERT INTO "posts" ("user_id", "title", "game", "description", "datetime", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    render json: {
        target: serialized_data(Post.find(params[:id]), PostSerializer),
        current: serialized_data(current_user, PostSerializer)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]