app/controllers/api/v1/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    render json: Post.find(params[:id])