app/controllers/api/v1/users_controller.rb

  def index
    render json: {
      target: serialized_data(User.all, UserSerializer),
      current: serialized_data(current_user, UserSerializer),
    }
---
SELECT "users".* FROM "users"

  def show
    render json: {
      target: serialized_data(User.find(params[:id]), UserSerializer),
      current: serialized_data(current_user, UserSerializer),
    }
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    render json: User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]